move surreal to graph mode
